orgCase/base_k-epsilon/system/snappyHexMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      snappyHexMeshDict;
}
castellatedMesh true;
snap            true;
addLayers       true;
geometry
{
  ball.stl
  {
    type triSurfaceMesh;
    name ball;
    regions
    {
      ball
      {
        name ball;
      }
    }
  }
  box0
  {
    type searchableBox;
    // Error epsilon is added/subtracted for stability.
    min (-2.000000001 -0.600000001 -0.600000001);
    max (4.000000001 0.600000001 0.600000001);
  }
  box1
  {
    type searchableBox;
    // Error epsilon is added/subtracted for stability.
    min (-1.000000001 -0.40000001 -0.40000001);
    max (2.000000001 0.40000001 0.40000001);
  }
}
castellatedMeshControls
{
  features (
  );
  refinementSurfaces
  {
    ball
    {
      level (0 0);
      regions
      {
        ball
        {
          level (0 0);
          patchInfo
          {
            type wall;
          }
        }
      }
    }
  }
  refinementRegions
  {
    box0
    {
      mode inside;
      levels ((3 2));
    }
    box1
    {
      mode inside;
      levels ((3 3));
    }
  }
  locationInMesh (2.0 0.0 0.0);
  maxLocalCells 100000000;
  maxGlobalCells 100000000;
  minRefinementCells 1;
  nCellsBetweenLevels 9;
  resolveFeatureAngle 30;
  allowFreeStandingZoneFaces false;
}
snapControls
{
  nSolveIter 30;
  nSmoothPatch 3;
  tolerance 4.0;
  nRelaxIter 5;
  nFeatureSnapIter 10;
}
addLayersControls
{
  layers
  {
    "ball*"
    {
      nSurfaceLayers 5;
    }
  }
  relativeSizes true;
  expansionRatio 1.0;
  finalLayerThickness 0.3;
  minThickness 0.03;
  nGrow 1;
  featureAngle 60;
  nRelaxIter 5;
  nSmoothSurfaceNormals 1;
  nSmoothNormals 3;
  nSmoothThickness 10;
  maxFaceThicknessRatio 0.5;
  maxThicknessToMedialRatio 0.3;
  minMedianAxisAngle 130;
  nBufferCellsNoExtrude 0;
  nLayerIter 50;
  nRelaxedIter 20;
}
meshQualityControls
{
  maxNonOrtho 65;
  maxBoundarySkewness 20;
  maxInternalSkewness 4;
  maxConcave 80;
  minFlatness 0.5;
  minVol 1.00E-13;
  minTetQuality -1e30;
  minArea -1;
  minTwist 0.05;
  minDeterminant 0.001;
  minFaceWeight 0.05;
  minVolRatio 0.01;
  minTriangleTwist -1;
  nSmoothScale 4;
  errorReduction 0.75;
  relaxed
  {
    maxNonOrtho 180;
  }
}
debug 0;
mergeTolerance 1e-5;
