orgCase/base_k-epsilon/0/nut
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    0;
    object      nut;
}
dimensions [0 2 -1 0 0 0 0];
internalField uniform 0.001;
boundaryField
{
    XMin
    {
        type calculated;
        value uniform 0.001;
    }
    XMax
    {
        type calculated;
        value uniform 0.001;
    }
    YMin
    {
        type zeroGradient;
    }
    YMax
    {
        type zeroGradient;
    }
    ZMin
    {
        type zeroGradient;
    }
    ZMax
    {
        type zeroGradient;
    }
    ball
    {
        type nutkWallFunction;
        value uniform 0.0;
    }
}
