orgCase/base_k-epsilon/system/fvSolution
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
solvers{
    p{
        solver PCG;
        preconditioner DIC;
        tolerance 1e-06;
        relTol 0.01;
    }
    U{
        solver PBiCG;
        preconditioner DILU;
        tolerance 1e-05;
        relTol 0.1;
    }
    k{
        solver PBiCG;
        preconditioner DILU;
        tolerance 1e-05;
        relTol 0.1;
    }
    epsilon{
        solver PBiCG;
        preconditioner DILU;
        tolerance 1e-05;
        relTol 0.1;
    }
}
SIMPLE{
    nNonOrthogonalCorrectors 0;
    residualControl{
        p 0.01;
        U 0.001;
        k 0.001;
        epsilon 0.001;
    }
}
relaxationFactors{
    fields{
        p 0.1;
    }
    equations{
        U 0.3;
        k 0.3;
        epsilon 0.3;
    }
}
