orgCase/base_k-epsilon/system/surfaceFeatureExtractDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      surfaceFeatureExtractDict;
}

ball.stl
{
    extractionMethod extractFromSurface;
    extractFromSurfaceCoeffs
    {
        includedAngle 165.0;
    }
    subsetFeatures
    {
        nonManifoldEdges no;
        openEdges yes;
    }
    writeObj yes;
}
